In [1]:
from __future__ import division
from numpy.random import randn
import numpy as np
import os
import matplotlib.pyplot as plt
np.random.seed(12345)
plt.rc('figure', figsize=(10, 6))
from pandas import Series, DataFrame
import pandas as pd
np.set_printoptions(precision=4)

In [2]:
from IPython.core.interactiveshell import InteractiveShell

In [3]:
InteractiveShell.ast_node_interactivity = 'all'

## 연습문제

In [4]:
import numpy as np
from pandas import DataFrame, Series
import pandas as pd

from sqlalchemy import create_engine
import cx_Oracle

#### 1. XE오라클 서버에 접속하여 emp, dept 테이블의 데이터를 
#### pandas 데이터프레임으로 읽으세요.

In [5]:
engine = create_engine('oracle://dream20:catcher@70.12.50.50:1521/XE')

In [6]:
with engine.connect() as conn, conn.begin():
    emp = pd.read_sql_table('emp',conn)
    dept = pd.read_sql_table('dept',conn)

In [7]:
emp
dept

    empno   ename        job     mgr   hiredate   sal    comm  deptno
0    7369   SMITH      CLERK  7902.0 1980-12-17   800     NaN      20
1    7499   ALLEN   SALESMAN  7698.0 1981-02-20  1600   300.0      30
2    7521    WARD   SALESMAN  7698.0 1981-02-22  1250   500.0      30
3    7566   JONES    MANAGER  7839.0 1981-04-02  2975     NaN      20
4    7654  MARTIN   SALESMAN  7698.0 1981-09-28  1250  1400.0      30
5    7698   BLAKE    MANAGER  7839.0 1981-05-01  2850     NaN      30
6    7782   CLARK    MANAGER  7839.0 1981-06-09  2450     NaN      10
7    7788   SCOTT    ANALYST  7566.0 1982-12-09  3000     NaN      20
8    7839    KING  PRESIDENT     NaN 1981-11-17  5000     NaN      10
9    7844  TURNER   SALESMAN  7698.0 1981-09-08  1500     0.0      30
10   7876   ADAMS      CLERK  7788.0 1983-01-12  1100     NaN      20
11   7900   JAMES      CLERK  7698.0 1981-12-03   950     NaN      30
12   7902    FORD    ANALYST  7566.0 1981-12-03  3000     NaN      20
13   7934  MILLER      CLERK  7782.0 1982-01-23  1300     NaN      10

   deptno       dname       loc
0      10  ACCOUNTING  NEW YORK
1      20    RESEARCH    DALLAS
2      30       SALES   CHICAGO
3      40  OPERATIONS    BOSTON

#### 2. 사원이름, 급여, 연봉을 출력하세요

In [8]:
emp_ann_sal = emp.sal * 12
emp_ann_sal.name = 'ann_sal'
emp[['ename', 'sal']].join(emp_ann_sal)

     ename   sal  ann_sal
0    SMITH   800     9600
1    ALLEN  1600    19200
2     WARD  1250    15000
3    JONES  2975    35700
4   MARTIN  1250    15000
5    BLAKE  2850    34200
6    CLARK  2450    29400
7    SCOTT  3000    36000
8     KING  5000    60000
9   TURNER  1500    18000
10   ADAMS  1100    13200
11   JAMES   950    11400
12    FORD  3000    36000
13  MILLER  1300    15600

#### 3. 연봉산정 방식이 커미션을 고려하는 것으로 바꼈습니다. 2번을 다시 수행하세요.
####     연봉 = 기존연봉 + 커미션
####     커미션이 없는 사원은 커미션을 0으로 간주하세요.

In [10]:
emp_ann_sal = 12*emp.sal + emp.comm.fillna(0)
emp_ann_sal.name = 'ann_sal'
emp[['ename', 'sal', 'comm']].join(emp_ann_sal)

     ename   sal    comm  ann_sal
0    SMITH   800     NaN   9600.0
1    ALLEN  1600   300.0  19500.0
2     WARD  1250   500.0  15500.0
3    JONES  2975     NaN  35700.0
4   MARTIN  1250  1400.0  16400.0
5    BLAKE  2850     NaN  34200.0
6    CLARK  2450     NaN  29400.0
7    SCOTT  3000     NaN  36000.0
8     KING  5000     NaN  60000.0
9   TURNER  1500     0.0  18000.0
10   ADAMS  1100     NaN  13200.0
11   JAMES   950     NaN  11400.0
12    FORD  3000     NaN  36000.0
13  MILLER  1300     NaN  15600.0

####  4. 다음의 사원정보를 나타내세요.
#### - 부서이름, 사원이름, 사원직무, 입사일, 급여

In [11]:
pd.merge(dept, emp)[['dname', 'ename', 'job', 'hiredate', 'sal']]

         dname   ename        job   hiredate   sal
0   ACCOUNTING   CLARK    MANAGER 1981-06-09  2450
1   ACCOUNTING    KING  PRESIDENT 1981-11-17  5000
2   ACCOUNTING  MILLER      CLERK 1982-01-23  1300
3     RESEARCH   SMITH      CLERK 1980-12-17   800
4     RESEARCH   JONES    MANAGER 1981-04-02  2975
5     RESEARCH   SCOTT    ANALYST 1982-12-09  3000
6     RESEARCH   ADAMS      CLERK 1983-01-12  1100
7     RESEARCH    FORD    ANALYST 1981-12-03  3000
8        SALES   ALLEN   SALESMAN 1981-02-20  1600
9        SALES    WARD   SALESMAN 1981-02-22  1250
10       SALES  MARTIN   SALESMAN 1981-09-28  1250
11       SALES   BLAKE    MANAGER 1981-05-01  2850
12       SALES  TURNER   SALESMAN 1981-09-08  1500
13       SALES   JAMES      CLERK 1981-12-03   950

In [13]:
result = pd.merge(dept, emp)[['dname', 'ename', 'job', 'hiredate', 'sal']]\
         .rename(columns={'dname' : '부서이름', 'ename': '사원이름',
                          'job' : '직무', 'hiredate' : '입사일', 'sal': '급여',
                         })
result

          부서이름    사원이름         직무        입사일    급여
0   ACCOUNTING   CLARK    MANAGER 1981-06-09  2450
1   ACCOUNTING    KING  PRESIDENT 1981-11-17  5000
2   ACCOUNTING  MILLER      CLERK 1982-01-23  1300
3     RESEARCH   SMITH      CLERK 1980-12-17   800
4     RESEARCH   JONES    MANAGER 1981-04-02  2975
5     RESEARCH   SCOTT    ANALYST 1982-12-09  3000
6     RESEARCH   ADAMS      CLERK 1983-01-12  1100
7     RESEARCH    FORD    ANALYST 1981-12-03  3000
8        SALES   ALLEN   SALESMAN 1981-02-20  1600
9        SALES    WARD   SALESMAN 1981-02-22  1250
10       SALES  MARTIN   SALESMAN 1981-09-28  1250
11       SALES   BLAKE    MANAGER 1981-05-01  2850
12       SALES  TURNER   SALESMAN 1981-09-08  1500
13       SALES   JAMES      CLERK 1981-12-03   950

#### 5. 부서별 사원의 급여합, 급여평균을 보고하세요.

In [18]:
result = emp.groupby('deptno')['sal']\
         .agg([sum, np.average])\
         .rename(columns={'sum': '급여합', 'average': '급여평균'})
result.index.names = ['부서번호']
result

        급여합         급여평균
부서번호
10     8750  2916.666667
20    10875  2175.000000
30     9400  1566.666667

#### 6. 부서별, 직무별 사원 수, 급여합, 급여평균을 보고하세요.

In [17]:
result = emp.groupby(['deptno', 'job'])['sal']\
         .agg(['count', sum, np.average])\
         .rename(columns={'sum': '급여합', 'average': '급여평균',
                          'coiunt': '사원 수',
                          })
result.index.names = ['부서번호', '직무']
result

                count   급여합  급여평균
부서번호 직무
10   CLERK          1  1300  1300
     MANAGER        1  2450  2450
     PRESIDENT      1  5000  5000
20   ANALYST        2  6000  3000
     CLERK          2  1900   950
     MANAGER        1  2975  2975
30   CLERK          1   950   950
     MANAGER        1  2850  2850
     SALESMAN       4  5600  1400

#### 7. 부서별 최상위 급여자를 출력하세요.

In [19]:
def top(df, n=5, column='sal'):
    return df.sort_values(by=column)[-n:]

In [20]:
result = emp.groupby('deptno', as_index=False).apply(top, 1, 'sal')
result[['deptno', 'empno', 'ename', 'job', 'sal']]

      deptno  empno  ename        job   sal
0 8       10   7839   KING  PRESIDENT  5000
1 12      20   7902   FORD    ANALYST  3000
2 5       30   7698  BLAKE    MANAGER  2850

# Time seires

In [21]:
from __future__ import division
from pandas import Series, DataFrame
import pandas as pd
from numpy.random import randn
import numpy as np
pd.options.display.max_rows = 12
np.set_printoptions(precision=4, suppress=True)
import matplotlib.pyplot as plt
plt.rc('figure', figsize=(12, 4))

In [22]:
%matplotlib inline

In [23]:
from IPython.core.interactiveshell import InteractiveShell
InteractiveShell.ast_node_interactivity = 'all'

## Date and Time Data Types and Tools

In [24]:
from datetime import datetime
now = datetime.now()
now

datetime.datetime(2017, 9, 12, 10, 31, 15, 620900)

In [25]:
now.year, now.month, now.day

(2017, 9, 12)

In [26]:
now.hour, now.minute, now.second, now.microsecond

(10, 31, 15, 620900)

In [27]:
delta = datetime(2017, 9, 12) - datetime(2017, 8, 8, 8, 15)
delta
delta.days
delta.seconds
delta.microseconds

datetime.timedelta(34, 56700)

34

56700

0

In [28]:
from datetime import timedelta
start = datetime(2011, 1, 7)
start + timedelta(12)

datetime.datetime(2011, 1, 19, 0, 0)

In [29]:
start -2 * timedelta(12)

datetime.datetime(2010, 12, 14, 0, 0)

## Converting between string and datetime

In [31]:
stamp = datetime(2011, 1, 3)

In [33]:
stamp
str(stamp)

datetime.datetime(2011, 1, 3, 0, 0)

'2011-01-03 00:00:00'

In [35]:
stamp.strftime('%Y-%m-%d')

'2011-01-03'

In [36]:
value = '2011-01-03'
datetime.strptime(value, '%Y-%m-%d')

datetime.datetime(2011, 1, 3, 0, 0)

In [39]:
datestrs = ['7/6/2011', '8/6/2011']
[datetime.strptime(x, '%m/%d/%Y') for x in datestrs]

[datetime.datetime(2011, 7, 6, 0, 0), datetime.datetime(2011, 8, 6, 0, 0)]

#### dateutil 패키지는 일반적으로 사람이 인지하는 날짜표현 방식으로 파싱가능

In [40]:
from dateutil.parser import parse
parse('2011-01-03')

datetime.datetime(2011, 1, 3, 0, 0)

In [41]:
parse('Jan 31, 1997 10:45 PM')

datetime.datetime(1997, 1, 31, 22, 45)

In [42]:
parse('09/10-2017')

datetime.datetime(2017, 9, 10, 0, 0)

In [46]:
parse('9 10,2017')

datetime.datetime(2017, 9, 10, 0, 0)

#### 날짜가 월 앞에 오는 경우

In [51]:
parse('6/12/2011')
parse('6/12/2011', dayfirst=True)
parse('3/24/2011', dayfirst=True)
# dayfirst옵션을 사용해도 월의 위치에 13이상의 숫자가 오면 자동으로 
# 일로 인식함.

datetime.datetime(2011, 6, 12, 0, 0)

datetime.datetime(2011, 12, 6, 0, 0)

datetime.datetime(2011, 3, 24, 0, 0)

#### pandas.to_datetime()
#### → 단일날짜 : pandas.Timestamp 형으로 변환
#### → 날짜의 배열 : pandas.DatetimeIndex

In [52]:
pd.to_datetime('2017-9-17')

Timestamp('2017-09-17 00:00:00')

In [53]:
datestrs

['7/6/2011', '8/6/2011']

In [54]:
pd.to_datetime(datestrs)

DatetimeIndex(['2011-07-06', '2011-08-06'], dtype='datetime64[ns]', freq=None)

#### 누락된 날짜 데이터 처리
#### → NaT (Not a Time)

In [55]:
datestrs + [None]

['7/6/2011', '8/6/2011', None]

In [56]:
idx = pd.to_datetime(datestrs + [None])
idx

DatetimeIndex(['2011-07-06', '2011-08-06', 'NaT'], dtype='datetime64[ns]', freq=None)

In [57]:
idx[2]

NaT

In [58]:
pd.isnull(idx)

array([False, False,  True], dtype=bool)

## Time Series Basics

In [59]:
from datetime import datetime
dates = [datetime(2011, 1, 2), datetime(2011, 1, 5), datetime(2011, 1, 7),
         datetime(2011, 1, 8), datetime(2011, 1, 10), datetime(2011, 1, 1)]

# index 인자로 입력된 datetime 리스트가 자동으로 DatetimeIndex 객체로 변환됨
ts = Series(np.random.randn(6), index=dates)
ts

2011-01-02   -0.204708
2011-01-05    0.478943
2011-01-07   -0.519439
2011-01-08   -0.555730
2011-01-10    1.965781
2011-01-01    1.393406
dtype: float64

In [60]:
type(ts)

pandas.core.series.Series

In [62]:
ts.index
ts.index[0]

DatetimeIndex(['2011-01-02', '2011-01-05', '2011-01-07', '2011-01-08',
               '2011-01-10', '2011-01-01'],
              dtype='datetime64[ns]', freq=None)

Timestamp('2011-01-02 00:00:00')

#### DatetimeIndex의 스칼라 값 : pandas의 Timestamp 객체

In [65]:
stamp = ts.index[0]
stamp

type(ts.index)
type(ts.index[0])

Timestamp('2011-01-02 00:00:00')

pandas.core.indexes.datetimes.DatetimeIndex

pandas._libs.tslib.Timestamp

In [66]:
ts + ts[::2]

2011-01-01         NaN
2011-01-02   -0.409415
2011-01-05         NaN
2011-01-07   -1.038877
2011-01-08         NaN
2011-01-10    3.931561
dtype: float64

In [68]:
ts.index.dtype

dtype('<M8[ns]')

In [69]:
stamp = ts.index[0]
stamp

Timestamp('2011-01-02 00:00:00')

## Indexing, selection, subsetting

In [70]:
stamp = ts.index[2]
ts[stamp]

-0.51943871505673811

In [73]:
ts['1/07/2011']
ts['20110107']
ts[datetime(2011, 1, 7)]

2011-01-07   -0.519439
dtype: float64

2011-01-07   -0.519439
dtype: float64

-0.51943871505673811

####  년 또는 월만 남겨서 해당기간의 데이터만 선택

In [75]:
longer_ts = Series(np.random.randn(1000),
                  index=pd.date_range('8/1/2017', periods=1000))
longer_ts

2017-08-01    0.488675
2017-08-02   -0.178098
2017-08-03    2.122315
2017-08-04    0.061192
2017-08-05    0.884111
2017-08-06   -0.608506
                ...
2020-04-21   -0.578828
2020-04-22    1.847446
2020-04-23    0.453739
2020-04-24   -0.302450
2020-04-25    1.402558
2020-04-26    1.212354
Freq: D, Length: 1000, dtype: float64

In [76]:
longer_ts['2017']

2017-08-01    0.488675
2017-08-02   -0.178098
2017-08-03    2.122315
2017-08-04    0.061192
2017-08-05    0.884111
2017-08-06   -0.608506
                ...
2017-12-26   -1.272728
2017-12-27   -0.673319
2017-12-28   -0.511005
2017-12-29   -1.489298
2017-12-30    0.667737
2017-12-31   -1.822946
Freq: D, Length: 153, dtype: float64

In [77]:
longer_ts['2017-09']

2017-09-01    0.334270
2017-09-02   -1.028389
2017-09-03   -0.168496
2017-09-04   -0.998948
2017-09-05   -1.531151
2017-09-06   -1.079111
                ...
2017-09-25    0.838295
2017-09-26   -1.034423
2017-09-27    0.434304
2017-09-28   -2.213133
2017-09-29    0.758040
2017-09-30    0.553933
Freq: D, Length: 30, dtype: float64

####  시계열 데이터를 특정 날짜를 기준으로 앞 또는 뒤 시계열 데이터를 버리기

In [78]:
ts
ts.truncate(after='1/8/2011')
ts.truncate(before='1/8/2011')

2011-01-02   -0.204708
2011-01-05    0.478943
2011-01-07   -0.519439
2011-01-08   -0.555730
2011-01-10    1.965781
2011-01-01    1.393406
dtype: float64

2011-01-02   -0.204708
2011-01-05    0.478943
2011-01-07   -0.519439
2011-01-08   -0.555730
dtype: float64

2011-01-08   -0.555730
2011-01-10    1.965781
2011-01-01    1.393406
dtype: float64

In [79]:
ts['1/6/2011':'1/11/2011']

2011-01-07   -0.519439
2011-01-08   -0.555730
2011-01-10    1.965781
dtype: float64

In [81]:
dates = pd.date_range('1/1/2000', periods=100, freq='W-WED')
long_df = DataFrame(np.random.randn(100, 4),
                    index=dates,
                    columns=['Colorado', 'Texas', 'New York', 'Ohio'])
long_df.loc['5-2001']

            Colorado     Texas  New York      Ohio
2001-05-02  0.159763 -0.809951  1.151664  1.142434
2001-05-09  0.836472 -0.023674 -1.652250 -1.612677
2001-05-16  1.198021  0.318338  0.262185  1.006644
2001-05-23  0.674148  0.093842  0.255735  0.190926
2001-05-30  1.144932 -0.294869 -0.200316  1.017884

## Time series with duplicate indices

In [82]:
dates = pd.DatetimeIndex(['1/1/2000', '1/2/2000', '1/2/2000', '1/2/2000',
                          '1/3/2000'])
dup_ts = Series(np.arange(5), index=dates)
dup_ts

2000-01-01    0
2000-01-02    1
2000-01-02    2
2000-01-02    3
2000-01-03    4
dtype: int32

In [83]:
dup_ts.index.is_unique

False

In [84]:
dup_ts['1/3/2000']  # not duplicated

4

In [85]:
dup_ts['1/2/2000']  # duplicated

2000-01-02    1
2000-01-02    2
2000-01-02    3
dtype: int32

In [86]:
grouped = dup_ts.groupby(level=0)
grouped.mean()

2000-01-01    0
2000-01-02    2
2000-01-03    4
dtype: int32

In [87]:
grouped.count()

2000-01-01    1
2000-01-02    3
2000-01-03    1
dtype: int64

## Date ranges, Frequencies, and Shifting

In [88]:
ts

2011-01-02   -0.204708
2011-01-05    0.478943
2011-01-07   -0.519439
2011-01-08   -0.555730
2011-01-10    1.965781
2011-01-01    1.393406
dtype: float64

In [90]:
ts.resample('D')

DatetimeIndexResampler [freq=<Day>, axis=0, closed=left, label=left, convention=start, base=0]

In [102]:
ts.resample('D').sum()

2011-01-01    1.393406
2011-01-02   -0.204708
2011-01-03         NaN
2011-01-04         NaN
2011-01-05    0.478943
2011-01-06         NaN
2011-01-07   -0.519439
2011-01-08   -0.555730
2011-01-09         NaN
2011-01-10    1.965781
Freq: D, dtype: float64

In [103]:
ts.resample('3d')
ts.resample('3d').sum()

DatetimeIndexResampler [freq=<3 * Days>, axis=0, closed=left, label=left, convention=start, base=0]

2011-01-01    1.188698
2011-01-04    0.478943
2011-01-07   -1.075169
2011-01-10    1.965781
Freq: 3D, dtype: float64

## Generating date ranges

In [91]:
index = pd.date_range('4/1/2012', '6/1/2012')
index

DatetimeIndex(['2012-04-01', '2012-04-02', '2012-04-03', '2012-04-04',
               '2012-04-05', '2012-04-06', '2012-04-07', '2012-04-08',
               '2012-04-09', '2012-04-10', '2012-04-11', '2012-04-12',
               '2012-04-13', '2012-04-14', '2012-04-15', '2012-04-16',
               '2012-04-17', '2012-04-18', '2012-04-19', '2012-04-20',
               '2012-04-21', '2012-04-22', '2012-04-23', '2012-04-24',
               '2012-04-25', '2012-04-26', '2012-04-27', '2012-04-28',
               '2012-04-29', '2012-04-30', '2012-05-01', '2012-05-02',
               '2012-05-03', '2012-05-04', '2012-05-05', '2012-05-06',
               '2012-05-07', '2012-05-08', '2012-05-09', '2012-05-10',
               '2012-05-11', '2012-05-12', '2012-05-13', '2012-05-14',
               '2012-05-15', '2012-05-16', '2012-05-17', '2012-05-18',
               '2012-05-19', '2012-05-20', '2012-05-21', '2012-05-22',
               '2012-05-23', '2012-05-24', '2012-05-25', '2012-05-26',
               '2012-05-27', '2012-05-28', '2012-05-29', '2012-05-30',
               '2012-05-31', '2012-06-01'],
              dtype='datetime64[ns]', freq='D')

In [92]:
pd.date_range(start='4/1/2012', periods=20)

DatetimeIndex(['2012-04-01', '2012-04-02', '2012-04-03', '2012-04-04',
               '2012-04-05', '2012-04-06', '2012-04-07', '2012-04-08',
               '2012-04-09', '2012-04-10', '2012-04-11', '2012-04-12',
               '2012-04-13', '2012-04-14', '2012-04-15', '2012-04-16',
               '2012-04-17', '2012-04-18', '2012-04-19', '2012-04-20'],
              dtype='datetime64[ns]', freq='D')

In [93]:
pd.date_range(end='6/1/2012', periods=20)

DatetimeIndex(['2012-05-13', '2012-05-14', '2012-05-15', '2012-05-16',
               '2012-05-17', '2012-05-18', '2012-05-19', '2012-05-20',
               '2012-05-21', '2012-05-22', '2012-05-23', '2012-05-24',
               '2012-05-25', '2012-05-26', '2012-05-27', '2012-05-28',
               '2012-05-29', '2012-05-30', '2012-05-31', '2012-06-01'],
              dtype='datetime64[ns]', freq='D')

#### 매월 마지막 영업일 포함

In [94]:
pd.date_range('1/1/2000', '12/1/2000', freq='BM')

DatetimeIndex(['2000-01-31', '2000-02-29', '2000-03-31', '2000-04-28',
               '2000-05-31', '2000-06-30', '2000-07-31', '2000-08-31',
               '2000-09-29', '2000-10-31', '2000-11-30'],
              dtype='datetime64[ns]', freq='BM')

In [95]:
pd.date_range('5/2/2012 12:56:31', periods=5)

DatetimeIndex(['2012-05-02 12:56:31', '2012-05-03 12:56:31',
               '2012-05-04 12:56:31', '2012-05-05 12:56:31',
               '2012-05-06 12:56:31'],
              dtype='datetime64[ns]', freq='D')

#### 자정시간에 맞추어 정규화

In [96]:
pd.date_range('5/2/2012 12:56:31', periods=5, normalize=True)

DatetimeIndex(['2012-05-02', '2012-05-03', '2012-05-04', '2012-05-05',
               '2012-05-06'],
              dtype='datetime64[ns]', freq='D')

In [105]:
pd.date_range('9/1/2017', '9/30/2017', freq='B')

DatetimeIndex(['2017-09-01', '2017-09-04', '2017-09-05', '2017-09-06',
               '2017-09-07', '2017-09-08', '2017-09-11', '2017-09-12',
               '2017-09-13', '2017-09-14', '2017-09-15', '2017-09-18',
               '2017-09-19', '2017-09-20', '2017-09-21', '2017-09-22',
               '2017-09-25', '2017-09-26', '2017-09-27', '2017-09-28',
               '2017-09-29'],
              dtype='datetime64[ns]', freq='B')

## Frequencies and Date Offsets

In [97]:
from pandas.tseries.offsets import Hour, Minute
hour = Hour()
hour

In [107]:
four_hours = Hour(4)
four_hours

In [108]:
pd.date_range('1/1/2000', '1/3/2000 23:59', freq='4h')
pd.date_range('1/1/2000', '1/3/2000 23:59', freq=Hour(4))

DatetimeIndex(['2000-01-01 00:00:00', '2000-01-01 04:00:00',
               '2000-01-01 08:00:00', '2000-01-01 12:00:00',
               '2000-01-01 16:00:00', '2000-01-01 20:00:00',
               '2000-01-02 00:00:00', '2000-01-02 04:00:00',
               '2000-01-02 08:00:00', '2000-01-02 12:00:00',
               '2000-01-02 16:00:00', '2000-01-02 20:00:00',
               '2000-01-03 00:00:00', '2000-01-03 04:00:00',
               '2000-01-03 08:00:00', '2000-01-03 12:00:00',
               '2000-01-03 16:00:00', '2000-01-03 20:00:00'],
              dtype='datetime64[ns]', freq='4H')

DatetimeIndex(['2000-01-01 00:00:00', '2000-01-01 04:00:00',
               '2000-01-01 08:00:00', '2000-01-01 12:00:00',
               '2000-01-01 16:00:00', '2000-01-01 20:00:00',
               '2000-01-02 00:00:00', '2000-01-02 04:00:00',
               '2000-01-02 08:00:00', '2000-01-02 12:00:00',
               '2000-01-02 16:00:00', '2000-01-02 20:00:00',
               '2000-01-03 00:00:00', '2000-01-03 04:00:00',
               '2000-01-03 08:00:00', '2000-01-03 12:00:00',
               '2000-01-03 16:00:00', '2000-01-03 20:00:00'],
              dtype='datetime64[ns]', freq='4H')

In [100]:
Hour(2) + Minute(30)

In [101]:
pd.date_range('1/1/2000', periods=10, freq='1h30min')

DatetimeIndex(['2000-01-01 00:00:00', '2000-01-01 01:30:00',
               '2000-01-01 03:00:00', '2000-01-01 04:30:00',
               '2000-01-01 06:00:00', '2000-01-01 07:30:00',
               '2000-01-01 09:00:00', '2000-01-01 10:30:00',
               '2000-01-01 12:00:00', '2000-01-01 13:30:00'],
              dtype='datetime64[ns]', freq='90T')

#### 월별주차(WOM, Week of month)

In [109]:
#매월 셋째 주 금요일
rng = pd.date_range('1/1/2017', '10/1/2017', freq='WOM-3FRI')
list(rng)

[Timestamp('2017-01-20 00:00:00', freq='WOM-3FRI'),
 Timestamp('2017-02-17 00:00:00', freq='WOM-3FRI'),
 Timestamp('2017-03-17 00:00:00', freq='WOM-3FRI'),
 Timestamp('2017-04-21 00:00:00', freq='WOM-3FRI'),
 Timestamp('2017-05-19 00:00:00', freq='WOM-3FRI'),
 Timestamp('2017-06-16 00:00:00', freq='WOM-3FRI'),
 Timestamp('2017-07-21 00:00:00', freq='WOM-3FRI'),
 Timestamp('2017-08-18 00:00:00', freq='WOM-3FRI'),
 Timestamp('2017-09-15 00:00:00', freq='WOM-3FRI')]

## Shifting (leading and lagging) data

In [111]:
ts = Series(np.random.randn(4),
            index=pd.date_range('9/1/2017', periods=4, freq='M'))
                                                       # freq='M'매월 마지막날
ts

2017-09-30    1.256686
2017-10-31    0.322049
2017-11-30    0.674715
2017-12-31   -1.146716
Freq: M, dtype: float64

#### 느슨한 쉬프트

In [112]:
ts.shift(2)

2017-09-30         NaN
2017-10-31         NaN
2017-11-30    1.256686
2017-12-31    0.322049
Freq: M, dtype: float64

In [113]:
ts.shift(-2)

2017-09-30    0.674715
2017-10-31   -1.146716
2017-11-30         NaN
2017-12-31         NaN
Freq: M, dtype: float64

In [115]:
ts
ts.shift(1)
ts / ts.shift(1) - 1 #전분기 대비 변화량

2017-09-30    1.256686
2017-10-31    0.322049
2017-11-30    0.674715
2017-12-31   -1.146716
Freq: M, dtype: float64

2017-09-30         NaN
2017-10-31    1.256686
2017-11-30    0.322049
2017-12-31    0.674715
Freq: M, dtype: float64

2017-09-30         NaN
2017-10-31   -0.743731
2017-11-30    1.095067
2017-12-31   -2.699556
Freq: M, dtype: float64

In [116]:
ts.pct_change()

2017-09-30         NaN
2017-10-31   -0.743731
2017-11-30    1.095067
2017-12-31   -2.699556
Freq: M, dtype: float64

In [117]:
ts.shift(2, freq='M') # freq에 설정한 값을 기준으로 이동함. 2개월씩 뒤로 이동

2017-11-30    1.256686
2017-12-31    0.322049
2018-01-31    0.674715
2018-02-28   -1.146716
Freq: M, dtype: float64

In [118]:
ts.shift(3, freq='D')

2017-10-03    1.256686
2017-11-03    0.322049
2017-12-03    0.674715
2018-01-03   -1.146716
dtype: float64

In [119]:
ts.shift(1, freq='3D')

2017-10-03    1.256686
2017-11-03    0.322049
2017-12-03    0.674715
2018-01-03   -1.146716
dtype: float64

In [120]:
ts.shift(1, freq='90T')

2017-09-30 01:30:00    1.256686
2017-10-31 01:30:00    0.322049
2017-11-30 01:30:00    0.674715
2017-12-31 01:30:00   -1.146716
Freq: M, dtype: float64

## Shifting dates with offsets

In [121]:
from pandas.tseries.offsets import Day, MonthEnd
now = datetime(2011, 11, 17)
now + 3 * Day()

Timestamp('2011-11-20 00:00:00')

In [122]:
now + MonthEnd()

Timestamp('2011-11-30 00:00:00')

In [125]:
now + MonthEnd(2)

Timestamp('2011-12-31 00:00:00')

In [128]:
offset = MonthEnd()
offset
offset.rollforward(now)

Timestamp('2011-11-30 00:00:00')

In [127]:
offset.rollback(now)

Timestamp('2011-10-31 00:00:00')

In [130]:
ts = Series(np.random.randn(20),
            index=pd.date_range('8/15/2017', periods=20, freq='4d'))
ts
ts.groupby(offset.rollforward).mean()

2017-08-15    0.366282
2017-08-19   -0.302875
2017-08-23    0.936582
2017-08-27    0.651144
2017-08-31   -0.769458
2017-09-04   -0.074776
                ...
2017-10-10   -0.855701
2017-10-14    1.181299
2017-10-18   -0.573171
2017-10-22    1.291222
2017-10-26   -1.887990
2017-10-30    2.417577
Freq: 4D, Length: 20, dtype: float64

2017-08-31    0.176335
2017-09-30    0.569718
2017-10-31    0.388672
dtype: float64

In [132]:
ts.resample('M').mean()

2017-08-31    0.176335
2017-09-30    0.569718
2017-10-31    0.388672
Freq: M, dtype: float64

## Time Zone Handling

In [135]:
import pytz
pytz.common_timezones[-10:]

['Pacific/Wake',
 'Pacific/Wallis',
 'US/Alaska',
 'US/Arizona',
 'US/Central',
 'US/Eastern',
 'US/Hawaii',
 'US/Mountain',
 'US/Pacific',
 'UTC']

In [140]:
[x for x in pytz.common_timezones if x.startswith('Asia')][:10]
[x for x in pytz.common_timezones if x.endswith('Seoul')]

['Asia/Aden',
 'Asia/Almaty',
 'Asia/Amman',
 'Asia/Anadyr',
 'Asia/Aqtau',
 'Asia/Aqtobe',
 'Asia/Ashgabat',
 'Asia/Atyrau',
 'Asia/Baghdad',
 'Asia/Bahrain']

['Asia/Seoul']

In [136]:
tz = pytz.timezone('US/Eastern')
tz

In [142]:
tz2 = pytz.timezone('Asia/Seoul')
tz2

## Localization and Conversion

In [143]:
rng = pd.date_range('3/9/2012 9:30', periods=6, freq='D')
ts = Series(np.random.randn(len(rng)), index=rng)

In [144]:
print(ts.index.tz)

None

In [145]:
pd.date_range('3/9/2012 9:30', periods=10, freq='D', tz='UTC')

DatetimeIndex(['2012-03-09 09:30:00+00:00', '2012-03-10 09:30:00+00:00',
               '2012-03-11 09:30:00+00:00', '2012-03-12 09:30:00+00:00',
               '2012-03-13 09:30:00+00:00', '2012-03-14 09:30:00+00:00',
               '2012-03-15 09:30:00+00:00', '2012-03-16 09:30:00+00:00',
               '2012-03-17 09:30:00+00:00', '2012-03-18 09:30:00+00:00'],
              dtype='datetime64[ns, UTC]', freq='D')

####  지정한 시간대로 시계열 변경
+ 시간대가 없는 시계열 : tz_localize()
+ 시간대가 있는 시계열 : tz_convert()

In [146]:
ts_utc = ts.tz_localize('UTC')
ts_utc

2012-03-09 09:30:00+00:00    0.200645
2012-03-10 09:30:00+00:00   -1.149752
2012-03-11 09:30:00+00:00   -1.122790
2012-03-12 09:30:00+00:00    0.523177
2012-03-13 09:30:00+00:00   -0.578221
2012-03-14 09:30:00+00:00   -0.647204
Freq: D, dtype: float64

In [151]:
ts_utc.index
ts_utc.index.tzinfo

DatetimeIndex(['2012-03-09 09:30:00+00:00', '2012-03-10 09:30:00+00:00',
               '2012-03-11 09:30:00+00:00', '2012-03-12 09:30:00+00:00',
               '2012-03-13 09:30:00+00:00', '2012-03-14 09:30:00+00:00'],
              dtype='datetime64[ns, UTC]', freq='D')

In [148]:
ts_utc.tz_convert('US/Eastern')

2012-03-09 04:30:00-05:00    0.200645
2012-03-10 04:30:00-05:00   -1.149752
2012-03-11 05:30:00-04:00   -1.122790
2012-03-12 05:30:00-04:00    0.523177
2012-03-13 05:30:00-04:00   -0.578221
2012-03-14 05:30:00-04:00   -0.647204
Freq: D, dtype: float64

In [149]:
ts_eastern = ts.tz_localize('US/Eastern')
ts_eastern.tz_convert('UTC')

2012-03-09 14:30:00+00:00    0.200645
2012-03-10 14:30:00+00:00   -1.149752
2012-03-11 13:30:00+00:00   -1.122790
2012-03-12 13:30:00+00:00    0.523177
2012-03-13 13:30:00+00:00   -0.578221
2012-03-14 13:30:00+00:00   -0.647204
Freq: D, dtype: float64

In [152]:
ts_eastern.tz_convert('Europe/Berlin')

2012-03-09 15:30:00+01:00    0.200645
2012-03-10 15:30:00+01:00   -1.149752
2012-03-11 14:30:00+01:00   -1.122790
2012-03-12 14:30:00+01:00    0.523177
2012-03-13 14:30:00+01:00   -0.578221
2012-03-14 14:30:00+01:00   -0.647204
Freq: D, dtype: float64

In [154]:
ts.index.tz_localize('Asia/Seoul')

DatetimeIndex(['2012-03-09 09:30:00+09:00', '2012-03-10 09:30:00+09:00',
               '2012-03-11 09:30:00+09:00', '2012-03-12 09:30:00+09:00',
               '2012-03-13 09:30:00+09:00', '2012-03-14 09:30:00+09:00'],
              dtype='datetime64[ns, Asia/Seoul]', freq='D')

## Operations with time zone-aware Timestamp objects

In [157]:
stamp = pd.Timestamp('2011-03-12 04:00')
stamp
stamp_utc = stamp.tz_localize('utc')
stamp_utc
stamp_utc.tz_convert('US/Eastern')
stamp_utc.tz_convert('US/Pacific')
stamp_utc.tz_convert('Asia/Seoul')

Timestamp('2011-03-12 04:00:00')

Timestamp('2011-03-12 04:00:00+0000', tz='UTC')

Timestamp('2011-03-11 23:00:00-0500', tz='US/Eastern')

Timestamp('2011-03-11 20:00:00-0800', tz='US/Pacific')

Timestamp('2011-03-12 13:00:00+0900', tz='Asia/Seoul')

In [158]:
show_time =pd.Timestamp('2017-09-11 10:00')
show_time_kr = show_time.tz_localize('Asia/Seoul');show_time_kr
show_time_kr.tz_convert('US/Eastern')

Timestamp('2017-09-11 10:00:00+0900', tz='Asia/Seoul')

Timestamp('2017-09-10 21:00:00-0400', tz='US/Eastern')

In [159]:
stamp_moscow = pd.Timestamp('2011-03-12 04:00', tz='Europe/Moscow')
stamp_moscow

Timestamp('2011-03-12 04:00:00+0300', tz='Europe/Moscow')

#### UNIX epoch(1970년 1월1일)부터 해당 시간까지의 나노초
+ 시간대 변환해도 그대로 유지
+ 일종의 절대시간 개념

In [160]:
stamp_utc.value

1299902400000000000

In [161]:
stamp_utc.tz_convert('US/Eastern').value

1299902400000000000

#### 일광 절약시간제를 고려한 시간계산

In [163]:
# 30 minutes before DST transition
from pandas.tseries.offsets import Hour
stamp = pd.Timestamp('2012-03-11 01:30', tz='US/Eastern')
stamp

Timestamp('2012-03-11 01:30:00-0500', tz='US/Eastern')

In [164]:
stamp + Hour()

Timestamp('2012-03-11 03:30:00-0400', tz='US/Eastern')

In [165]:
# 90 minutes before DST transition
stamp = pd.Timestamp('2012-11-04 00:30', tz='US/Eastern')
stamp

Timestamp('2012-11-04 00:30:00-0400', tz='US/Eastern')

In [166]:
stamp + 2 * Hour()

Timestamp('2012-11-04 01:30:00-0500', tz='US/Eastern')

## Operations between different time zones

#### 서로 다른시간대의 연산 결과는 UTC로 표시됨

In [167]:
rng = pd.date_range('3/7/2012 9:30', periods=10, freq='B')
ts = Series(np.random.randn(len(rng)), index=rng)
ts

2012-03-07 09:30:00    2.157700
2012-03-08 09:30:00   -0.405951
2012-03-09 09:30:00   -0.218444
2012-03-12 09:30:00   -0.161804
2012-03-13 09:30:00   -1.221525
2012-03-14 09:30:00    1.116641
2012-03-15 09:30:00    0.317819
2012-03-16 09:30:00   -0.189406
2012-03-19 09:30:00    2.045049
2012-03-20 09:30:00   -0.730178
Freq: B, dtype: float64

In [171]:
ts1 = ts[:7].tz_localize('Europe/London')
ts2 = ts1[2:].tz_convert('Europe/Moscow')
ts1.index
ts2.index

DatetimeIndex(['2012-03-07 09:30:00+00:00', '2012-03-08 09:30:00+00:00',
               '2012-03-09 09:30:00+00:00', '2012-03-12 09:30:00+00:00',
               '2012-03-13 09:30:00+00:00', '2012-03-14 09:30:00+00:00',
               '2012-03-15 09:30:00+00:00'],
              dtype='datetime64[ns, Europe/London]', freq='B')

DatetimeIndex(['2012-03-09 13:30:00+04:00', '2012-03-12 13:30:00+04:00',
               '2012-03-13 13:30:00+04:00', '2012-03-14 13:30:00+04:00',
               '2012-03-15 13:30:00+04:00'],
              dtype='datetime64[ns, Europe/Moscow]', freq='B')

In [170]:
result = ts1 + ts2
result.index

DatetimeIndex(['2012-03-07 09:30:00+00:00', '2012-03-08 09:30:00+00:00',
               '2012-03-09 09:30:00+00:00', '2012-03-12 09:30:00+00:00',
               '2012-03-13 09:30:00+00:00', '2012-03-14 09:30:00+00:00',
               '2012-03-15 09:30:00+00:00'],
              dtype='datetime64[ns, UTC]', freq='B')

In [172]:
ts1
ts2
result

2012-03-07 09:30:00+00:00    2.157700
2012-03-08 09:30:00+00:00   -0.405951
2012-03-09 09:30:00+00:00   -0.218444
2012-03-12 09:30:00+00:00   -0.161804
2012-03-13 09:30:00+00:00   -1.221525
2012-03-14 09:30:00+00:00    1.116641
2012-03-15 09:30:00+00:00    0.317819
Freq: B, dtype: float64

2012-03-09 13:30:00+04:00   -0.218444
2012-03-12 13:30:00+04:00   -0.161804
2012-03-13 13:30:00+04:00   -1.221525
2012-03-14 13:30:00+04:00    1.116641
2012-03-15 13:30:00+04:00    0.317819
Freq: B, dtype: float64

2012-03-07 09:30:00+00:00         NaN
2012-03-08 09:30:00+00:00         NaN
2012-03-09 09:30:00+00:00   -0.436887
2012-03-12 09:30:00+00:00   -0.323609
2012-03-13 09:30:00+00:00   -2.443050
2012-03-14 09:30:00+00:00    2.233282
2012-03-15 09:30:00+00:00    0.635638
Freq: B, dtype: float64

## Periods and Period Arithmetic

In [173]:
p = pd.Period(2007, freq='A-DEC')
p

Period('2007', 'A-DEC')

In [175]:
p + 5

Period('2012', 'A-DEC')

In [176]:
p - 2

Period('2005', 'A-DEC')

In [177]:
pd.Period('2014', freq='A-dec')-p

7

#### pandas.period_rangge): PeriodIndex 생성

In [178]:
rng = pd.period_range('1/1/2000', '6/30/2000', freq='M')
rng

PeriodIndex(['2000-01', '2000-02', '2000-03', '2000-04', '2000-05', '2000-06'], dtype='period[M]', freq='M')

In [179]:
Series(np.random.randn(6), index=rng)

2000-01    1.370988
2000-02    0.577735
2000-03   -0.862945
2000-04    1.152521
2000-05   -1.004754
2000-06   -0.884470
Freq: M, dtype: float64

In [181]:
values = ['2001Q3','2002Q2','2003Q1']
index = pd.PeriodIndex(values, freq='Q-DEC')
index
pd

PeriodIndex(['2001Q3', '2002Q2', '2003Q1'], dtype='period[Q-DEC]', freq='Q-DEC')

## Period Frequency Conversion

In [182]:
p = pd.Period('2007', freq='A-DEC');p
p.asfreq('M', how='start')

Period('2007', 'A-DEC')

Period('2007-01', 'M')

In [184]:
p.asfreq('M', how='end')
p.asfreq('D', how='end')
p.asfreq('H', how='end')
p.asfreq('H', how='start')

Period('2007-12', 'M')

Period('2007-12-31', 'D')

Period('2007-12-31 23:00', 'H')

Period('2007-01-01 00:00', 'H')

In [185]:
p = pd.Period('2007', freq='A-JUN')
p.asfreq('M', 'start')

Period('2006-07', 'M')

In [186]:
p.asfreq('M', 'end')

Period('2007-06', 'M')

####  하위 단계기간 → 상위 단계기간
+ 상위기간은 하위기간이 어디에 속했는지에 따라 결정

In [188]:
p = pd.Period('2007', freq='M')
p
p.asfreq('A-JUN')

Period('2007-01', 'M')

Period('2007', 'A-JUN')

#### PeriodIndex 객체도 마찬가지로 다루자

In [189]:
rng = pd.period_range('2006', '2009', freq='A-DEC')
ts = Series(np.random.randn(len(rng)), index=rng)
ts

2006    0.567387
2007   -0.235968
2008   -0.739870
2009   -0.412543
Freq: A-DEC, dtype: float64

In [190]:
ts.asfreq
ts.asfreq('M', how='start')

<bound method NDFrame.asfreq of 2006    0.567387
2007   -0.235968
2008   -0.739870
2009   -0.412543
Freq: A-DEC, dtype: float64>

2006-01    0.567387
2007-01   -0.235968
2008-01   -0.739870
2009-01   -0.412543
Freq: M, dtype: float64

In [191]:
ts.asfreq('B', how='end')

2006-12-29    0.567387
2007-12-31   -0.235968
2008-12-31   -0.739870
2009-12-31   -0.412543
Freq: B, dtype: float64

## Quarterly period frequencies

+ 회계연도의 끝에 따라 의미가 달라짐
+ 12가지의 분기 빈도 : Q-JAN ~ Q-DEC

In [194]:
p = pd.Period('2017Q3', freq='Q-DEC')
p
p2 = pd.Period('2017Q3', freq='Q-JAN')
p2

Period('2017Q3', 'Q-DEC')

Period('2017Q3', 'Q-JAN')

In [195]:
p.asfreq('D', 'start') # 2017 Q1:1,2,3 / Q2:4,5,6/ Q3:7,8,9/ Q4:10,11,12
p2.asfreq('D','S')     # 2016 Q1:2,3,4/ Q2:5,6,7/ Q3:8,9,10/ Q4:11,12,1(2017년1월)

Period('2017-07-01', 'D')

Period('2016-08-01', 'D')

In [196]:
p.asfreq('D', 'end')
p2.asfreq('D','E')

Period('2017-09-30', 'D')

Period('2016-10-31', 'D')

#### 2017년 3분기영업 마감일의 오후 4시

In [197]:
p4pm = (p.asfreq('B','e') - 1).asfreq('T', 's') + 16*60
p4pm

Period('2017-09-28 16:00', 'T')

In [198]:
p.asfreq('B','e').asfreq('T','s') + 16 * 60

Period('2017-09-29 16:00', 'T')

In [199]:
p4pm.to_timestamp()

Timestamp('2017-09-28 16:00:00')

#### pandas.period_range()를 이용한 분기범위 만들기

In [200]:
rng = pd.period_range('2016Q3', '2017Q4', freq='Q-JAN')
ts = Series(np.arange(len(rng)), index=rng)
ts

2016Q3    0
2016Q4    1
2017Q1    2
2017Q2    3
2017Q3    4
2017Q4    5
Freq: Q-JAN, dtype: int32

In [201]:
new_rng = rng.asfreq('B', 'e').asfreq('T', 's') + 16 * 60
ts.index = new_rng.to_timestamp()
ts

2015-10-30 16:00:00    0
2016-01-29 16:00:00    1
2016-04-29 16:00:00    2
2016-07-29 16:00:00    3
2016-10-31 16:00:00    4
2017-01-31 16:00:00    5
Freq: BQ-OCT, dtype: int32

## Converting Timestamps to Periods(and block)

In [202]:
rng = pd.date_range('1/1/2000', periods=3, freq='M')
ts = Series(randn(3), index=rng)
pts = ts.to_period()
ts

2000-01-31   -1.535447
2000-02-29   -2.034712
2000-03-31    0.579498
Freq: M, dtype: float64

#### to_period()에 의해 변환되는 빈도(freq.)는 추정된다

In [203]:
pts = ts.to_period()
pts

2000-01   -1.535447
2000-02   -2.034712
2000-03    0.579498
Freq: M, dtype: float64

In [205]:
rng = pd.date_range('1/29/2000', periods=6, freq='D')
ts2 = Series(randn(6), index=rng)
ts2
ts2.to_period('M')

2000-01-29    0.266273
2000-01-30    0.560855
2000-01-31   -0.910333
2000-02-01    2.272422
2000-02-02   -1.553641
2000-02-03   -0.502540
Freq: D, dtype: float64

2000-01    0.266273
2000-01    0.560855
2000-01   -0.910333
2000-02    2.272422
2000-02   -1.553641
2000-02   -0.502540
Freq: M, dtype: float64

In [208]:
pts.to_timestamp(how='end')

2000-01-31   -1.535447
2000-02-29   -2.034712
2000-03-31    0.579498
Freq: M, dtype: float64

## Creating a PeriodIndex from arrays

In [214]:
data = pd.read_csv('ch08/macrodata.csv')
data.year

0      1959.0
1      1959.0
2      1959.0
3      1959.0
4      1960.0
5      1960.0
        ...
197    2008.0
198    2008.0
199    2008.0
200    2009.0
201    2009.0
202    2009.0
Name: year, Length: 203, dtype: float64

In [215]:
data.quarter

0      1.0
1      2.0
2      3.0
3      4.0
4      1.0
5      2.0
      ...
197    2.0
198    3.0
199    4.0
200    1.0
201    2.0
202    3.0
Name: quarter, Length: 203, dtype: float64

In [216]:
index = pd.PeriodIndex(year=data.year, quarter=data.quarter, freq='Q-DEC')
index

PeriodIndex(['1959Q1', '1959Q2', '1959Q3', '1959Q4', '1960Q1', '1960Q2',
             '1960Q3', '1960Q4', '1961Q1', '1961Q2',
             ...
             '2007Q2', '2007Q3', '2007Q4', '2008Q1', '2008Q2', '2008Q3',
             '2008Q4', '2009Q1', '2009Q2', '2009Q3'],
            dtype='period[Q-DEC]', length=203, freq='Q-DEC')

In [217]:
data[:10]

,year,quarter,realgdp,realcons,realinv,realgovt,realdpi,cpi,m1,tbilrate,unemp,pop,infl,realint
0,1959.0,1.0,2710.349,1707.4,286.898,470.045,1886.9,28.98,139.7,2.82,5.8,177.146,0.00,0.00
1,1959.0,2.0,2778.801,1733.7,310.859,481.301,1919.7,29.15,141.7,3.08,5.1,177.830,2.34,0.74
2,1959.0,3.0,2775.488,1751.8,289.226,491.260,1916.4,29.35,140.5,3.82,5.3,178.657,2.74,1.09
3,1959.0,4.0,2785.204,1753.7,299.356,484.052,1931.3,29.37,140.0,4.33,5.6,179.386,0.27,4.06
4,1960.0,1.0,2847.699,1770.5,331.722,462.199,1955.5,29.54,139.6,3.50,5.2,180.007,2.31,1.19
5,1960.0,2.0,2834.390,1792.9,298.152,460.400,1966.1,29.55,140.2,2.68,5.2,180.671,0.14,2.55
6,1960.0,3.0,2839.022,1785.8,296.375,474.676,1967.8,29.75,140.9,2.36,5.6,181.528,2.70,-0.34
7,1960.0,4.0,2802.616,1788.2,259.764,476.434,1966.6,29.84,141.1,2.29,6.3,182.287,1.21,1.08
8,1961.0,1.0,2819.264,1787.7,266.405,475.854,1984.5,29.81,142.1,2.37,6.8,182.992,-0.40,2.77
9,1961.0,2.0,2872.005,1814.3,286.246,480.328,2014.4,29.92,142.9,2.29,7.0,183.691,1.47,0.81

In [218]:
data.index = index
data.infl
data[:10]

1959Q1    0.00
1959Q2    2.34
1959Q3    2.74
1959Q4    0.27
1960Q1    2.31
1960Q2    0.14
          ...
2008Q2    8.53
2008Q3   -3.16
2008Q4   -8.79
2009Q1    0.94
2009Q2    3.37
2009Q3    3.56
Freq: Q-DEC, Name: infl, Length: 203, dtype: float64

,year,quarter,realgdp,realcons,realinv,realgovt,realdpi,cpi,m1,tbilrate,unemp,pop,infl,realint
1959Q1,1959.0,1.0,2710.349,1707.4,286.898,470.045,1886.9,28.98,139.7,2.82,5.8,177.146,0.00,0.00
1959Q2,1959.0,2.0,2778.801,1733.7,310.859,481.301,1919.7,29.15,141.7,3.08,5.1,177.830,2.34,0.74
1959Q3,1959.0,3.0,2775.488,1751.8,289.226,491.260,1916.4,29.35,140.5,3.82,5.3,178.657,2.74,1.09
1959Q4,1959.0,4.0,2785.204,1753.7,299.356,484.052,1931.3,29.37,140.0,4.33,5.6,179.386,0.27,4.06
1960Q1,1960.0,1.0,2847.699,1770.5,331.722,462.199,1955.5,29.54,139.6,3.50,5.2,180.007,2.31,1.19
1960Q2,1960.0,2.0,2834.390,1792.9,298.152,460.400,1966.1,29.55,140.2,2.68,5.2,180.671,0.14,2.55
1960Q3,1960.0,3.0,2839.022,1785.8,296.375,474.676,1967.8,29.75,140.9,2.36,5.6,181.528,2.70,-0.34
1960Q4,1960.0,4.0,2802.616,1788.2,259.764,476.434,1966.6,29.84,141.1,2.29,6.3,182.287,1.21,1.08
1961Q1,1961.0,1.0,2819.264,1787.7,266.405,475.854,1984.5,29.81,142.1,2.37,6.8,182.992,-0.40,2.77
1961Q2,1961.0,2.0,2872.005,1814.3,286.246,480.328,2014.4,29.92,142.9,2.29,7.0,183.691,1.47,0.81

## Resampling and Frequency Conversion

+ Resampling : 시계열의 빈도를 변경하는 작업
    + 다운샘플링 : 상위빈도 → 하위빈도
        + 표본을 천천히 뽑겠다.
        + 그룹 집계
    + 업샘플링 : 하위빈도 → 상위빈도
        + 보간



+ resample method
    + Series.resample()
    + DataFrame.resample()
    + DataFrameGroupBy.resample()

In [221]:
rng = pd.date_range('1/1/2000', periods=100, freq='D')
ts = Series(randn(len(rng)), index=rng)
ts
ts.resample('M').mean()

2000-01-01   -2.881858
2000-01-02    0.526440
2000-01-03   -2.127004
2000-01-04   -0.726933
2000-01-05   -1.193986
2000-01-06   -0.949803
                ...
2000-04-04    0.310647
2000-04-05   -1.023775
2000-04-06    0.501169
2000-04-07   -0.227167
2000-04-08    0.123005
2000-04-09   -0.548465
Freq: D, Length: 100, dtype: float64

2000-01-31   -0.188949
2000-02-29   -0.002802
2000-03-31    0.329019
2000-04-30    0.204247
Freq: M, dtype: float64

In [222]:
ts.resample('M', kind='period').mean()

2000-01   -0.188949
2000-02   -0.002802
2000-03    0.329019
2000-04    0.204247
Freq: M, dtype: float64

## Downsampling
+ 샘플링(표본추출) 비율을 낮추는 작업
    + 표본을 천천히 뽑겠다
+ 고려사항
    + 각 간격의 양 끝 중에서 열어둘 쪽
    + 집계하려는 구간의 레이블을 간격의 시작으로 할지 끝으로 할지 여부

In [223]:
rng = pd.date_range('1/1/2000', periods=12, freq='T')
ts = Series(np.arange(12), index=rng)
ts

2000-01-01 00:00:00     0
2000-01-01 00:01:00     1
2000-01-01 00:02:00     2
2000-01-01 00:03:00     3
2000-01-01 00:04:00     4
2000-01-01 00:05:00     5
2000-01-01 00:06:00     6
2000-01-01 00:07:00     7
2000-01-01 00:08:00     8
2000-01-01 00:09:00     9
2000-01-01 00:10:00    10
2000-01-01 00:11:00    11
Freq: T, dtype: int32

####  5분 단위로 묶고 묶은 결과는 합으로

In [224]:
ts.resample('5min').sum()

2000-01-01 00:00:00    10
2000-01-01 00:05:00    35
2000-01-01 00:10:00    21
Freq: 5T, dtype: int32

In [225]:
ts.resample('5min', closed='left').sum() # closed='left'값이 default

2000-01-01 00:00:00    10
2000-01-01 00:05:00    35
2000-01-01 00:10:00    21
Freq: 5T, dtype: int32

In [226]:
ts.resample('5min', closed='right').sum()

1999-12-31 23:55:00     0
2000-01-01 00:00:00    15
2000-01-01 00:05:00    40
2000-01-01 00:10:00    11
Freq: 5T, dtype: int32

In [227]:
ts.resample('5min', closed='right', label='right').sum()

2000-01-01 00:00:00     0
2000-01-01 00:05:00    15
2000-01-01 00:10:00    40
2000-01-01 00:15:00    11
Freq: 5T, dtype: int32

In [231]:
ts.resample('5min', loffset='-1s').sum()
#default값 closed='left'로 적용된 후 Index를 1초 앞당겨 반환

1999-12-31 23:59:59    10
2000-01-01 00:04:59    35
2000-01-01 00:09:59    21
Freq: 5T, dtype: int32

### Open-High-Low-Close (OHLC) resampling

In [232]:
ts.resample('5min').ohlc()

                     open  high  low  close
2000-01-01 00:00:00     0     4    0      4
2000-01-01 00:05:00     5     9    5      9
2000-01-01 00:10:00    10    11   10     11

### Resampling with GroupBy

In [234]:
rng = pd.date_range('1/1/2000', periods=100, freq='D')
ts = Series(np.arange(100), index=rng)
ts
ts.groupby(lambda x: x.month).mean()

2000-01-01     0
2000-01-02     1
2000-01-03     2
2000-01-04     3
2000-01-05     4
2000-01-06     5
              ..
2000-04-04    94
2000-04-05    95
2000-04-06    96
2000-04-07    97
2000-04-08    98
2000-04-09    99
Freq: D, Length: 100, dtype: int32

1    15
2    45
3    75
4    95
dtype: int32

####  DatetimeIndex.weekday
+ Monday=0, Sunday=6

In [236]:
ts.groupby(lambda x: x.weekday).mean()

0    47.5
1    48.5
2    49.5
3    50.5
4    51.5
5    49.0
6    50.0
dtype: float64

## Upsampling and interpolation

In [237]:
frame = DataFrame(np.random.randn(2, 4),
                  index=pd.date_range('1/1/2000', periods=2, freq='W-WED'),
                  columns=['Colorado', 'Texas', 'New York', 'Ohio'])
frame

            Colorado     Texas  New York      Ohio
2000-01-05  0.909617  1.475824  0.584234 -0.573963
2000-01-12  0.350913 -2.128789  1.008115 -0.550860

#### 누락값 발생

In [240]:
df_daily = frame.resample('D').asfreq()
df_daily

            Colorado     Texas  New York      Ohio
2000-01-05  0.909617  1.475824  0.584234 -0.573963
2000-01-06       NaN       NaN       NaN       NaN
2000-01-07       NaN       NaN       NaN       NaN
2000-01-08       NaN       NaN       NaN       NaN
2000-01-09       NaN       NaN       NaN       NaN
2000-01-10       NaN       NaN       NaN       NaN
2000-01-11       NaN       NaN       NaN       NaN
2000-01-12  0.350913 -2.128789  1.008115 -0.550860

#### 보간
+ ffill() : 이전 값으로 채우기
+ bfill() : 이후 값으로 채우기

In [241]:
frame.resample('D').ffill()

            Colorado     Texas  New York      Ohio
2000-01-05  0.909617  1.475824  0.584234 -0.573963
2000-01-06  0.909617  1.475824  0.584234 -0.573963
2000-01-07  0.909617  1.475824  0.584234 -0.573963
2000-01-08  0.909617  1.475824  0.584234 -0.573963
2000-01-09  0.909617  1.475824  0.584234 -0.573963
2000-01-10  0.909617  1.475824  0.584234 -0.573963
2000-01-11  0.909617  1.475824  0.584234 -0.573963
2000-01-12  0.350913 -2.128789  1.008115 -0.550860

In [242]:
frame.resample('D').bfill()

            Colorado     Texas  New York      Ohio
2000-01-05  0.909617  1.475824  0.584234 -0.573963
2000-01-06  0.350913 -2.128789  1.008115 -0.550860
2000-01-07  0.350913 -2.128789  1.008115 -0.550860
2000-01-08  0.350913 -2.128789  1.008115 -0.550860
2000-01-09  0.350913 -2.128789  1.008115 -0.550860
2000-01-10  0.350913 -2.128789  1.008115 -0.550860
2000-01-11  0.350913 -2.128789  1.008115 -0.550860
2000-01-12  0.350913 -2.128789  1.008115 -0.550860

In [243]:
frame.resample('D').ffill(limit=2)

            Colorado     Texas  New York      Ohio
2000-01-05  0.909617  1.475824  0.584234 -0.573963
2000-01-06  0.909617  1.475824  0.584234 -0.573963
2000-01-07  0.909617  1.475824  0.584234 -0.573963
2000-01-08       NaN       NaN       NaN       NaN
2000-01-09       NaN       NaN       NaN       NaN
2000-01-10       NaN       NaN       NaN       NaN
2000-01-11       NaN       NaN       NaN       NaN
2000-01-12  0.350913 -2.128789  1.008115 -0.550860

In [245]:
frame.resample('W-THU').asfreq()
frame.resample('W-THU').ffill()
frame.resample('W-THU').bfill()

            Colorado  Texas  New York  Ohio
2000-01-06       NaN    NaN       NaN   NaN
2000-01-13       NaN    NaN       NaN   NaN

            Colorado     Texas  New York      Ohio
2000-01-06  0.909617  1.475824  0.584234 -0.573963
2000-01-13  0.350913 -2.128789  1.008115 -0.550860

            Colorado     Texas  New York     Ohio
2000-01-06  0.350913 -2.128789  1.008115 -0.55086
2000-01-13       NaN       NaN       NaN      NaN